grevaillot/svd_tools/headers/ATSAM3X8H/usart2.h
#pragma once 

/* --- USART2: Universal Synchronous Asynchronous Receiver Transmitter 2  */

/** @defgroup usart2_registers Universal Synchronous Asynchronous Receiver Transmitter 2 Register
@{*/

/** USART2_CR Control Register **/
#define USART2_CR			MMIO32(USART2_BASE + 0x00)
/** USART2_CR_SPI_MODE Control Register **/
#define USART2_CR_SPI_MODE			MMIO32(USART2_BASE + 0x00)
/** USART2_MR Mode Register **/
#define USART2_MR			MMIO32(USART2_BASE + 0x04)
/** USART2_MR_SPI_MODE Mode Register **/
#define USART2_MR_SPI_MODE			MMIO32(USART2_BASE + 0x04)
/** USART2_IER Interrupt Enable Register **/
#define USART2_IER			MMIO32(USART2_BASE + 0x08)
/** USART2_IER_SPI_MODE Interrupt Enable Register **/
#define USART2_IER_SPI_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_IER_LIN_MODE Interrupt Enable Register **/
#define USART2_IER_LIN_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_IDR Interrupt Disable Register **/
#define USART2_IDR			MMIO32(USART2_BASE + 0x0c)
/** USART2_IDR_SPI_MODE Interrupt Disable Register **/
#define USART2_IDR_SPI_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_IDR_LIN_MODE Interrupt Disable Register **/
#define USART2_IDR_LIN_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_IMR Interrupt Mask Register **/
#define USART2_IMR			MMIO32(USART2_BASE + 0x10)
/** USART2_IMR_SPI_MODE Interrupt Mask Register **/
#define USART2_IMR_SPI_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_IMR_LIN_MODE Interrupt Mask Register **/
#define USART2_IMR_LIN_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_CSR Channel Status Register **/
#define USART2_CSR			MMIO32(USART2_BASE + 0x14)
/** USART2_CSR_SPI_MODE Channel Status Register **/
#define USART2_CSR_SPI_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_CSR_LIN_MODE Channel Status Register **/
#define USART2_CSR_LIN_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_RHR Receive Holding Register **/
#define USART2_RHR			MMIO32(USART2_BASE + 0x18)
/** USART2_THR Transmit Holding Register **/
#define USART2_THR			MMIO32(USART2_BASE + 0x1c)
/** USART2_BRGR Baud Rate Generator Register **/
#define USART2_BRGR			MMIO32(USART2_BASE + 0x20)
/** USART2_RTOR Receiver Time-out Register **/
#define USART2_RTOR			MMIO32(USART2_BASE + 0x24)
/** USART2_TTGR Transmitter Timeguard Register **/
#define USART2_TTGR			MMIO32(USART2_BASE + 0x28)
/** USART2_FIDI FI DI Ratio Register **/
#define USART2_FIDI			MMIO32(USART2_BASE + 0x40)
/** USART2_NER Number of Errors Register **/
#define USART2_NER			MMIO32(USART2_BASE + 0x44)
/** USART2_IF IrDA Filter Register **/
#define USART2_IF			MMIO32(USART2_BASE + 0x4c)
/** USART2_MAN Manchester Configuration Register **/
#define USART2_MAN			MMIO32(USART2_BASE + 0x50)
/** USART2_LINMR LIN Mode Register **/
#define USART2_LINMR			MMIO32(USART2_BASE + 0x54)
/** USART2_LINIR LIN Identifier Register **/
#define USART2_LINIR			MMIO32(USART2_BASE + 0x58)
/** USART2_LINBRR LIN Baud Rate Register **/
#define USART2_LINBRR			MMIO32(USART2_BASE + 0x5c)
/** USART2_WPMR Write Protection Mode Register **/
#define USART2_WPMR			MMIO32(USART2_BASE + 0xe4)
/** USART2_WPSR Write Protection Status Register **/
#define USART2_WPSR			MMIO32(USART2_BASE + 0xe8)
/** USART2_RPR Receive Pointer Register **/
#define USART2_RPR			MMIO32(USART2_BASE + 0x100)
/** USART2_RCR Receive Counter Register **/
#define USART2_RCR			MMIO32(USART2_BASE + 0x104)
/** USART2_TPR Transmit Pointer Register **/
#define USART2_TPR			MMIO32(USART2_BASE + 0x108)
/** USART2_TCR Transmit Counter Register **/
#define USART2_TCR			MMIO32(USART2_BASE + 0x10c)
/** USART2_RNPR Receive Next Pointer Register **/
#define USART2_RNPR			MMIO32(USART2_BASE + 0x110)
/** USART2_RNCR Receive Next Counter Register **/
#define USART2_RNCR			MMIO32(USART2_BASE + 0x114)
/** USART2_TNPR Transmit Next Pointer Register **/
#define USART2_TNPR			MMIO32(USART2_BASE + 0x118)
/** USART2_TNCR Transmit Next Counter Register **/
#define USART2_TNCR			MMIO32(USART2_BASE + 0x11c)
/** USART2_PTCR Transfer Control Register **/
#define USART2_PTCR			MMIO32(USART2_BASE + 0x120)
/** USART2_PTSR Transfer Status Register **/
#define USART2_PTSR			MMIO32(USART2_BASE + 0x124)

/**@}*/


/** @defgroup usart2_cr CR Control Register
@{*/

/** USART2_CR_LINWKUP Send LIN Wakeup Signal **/
#define USART2_CR_LINWKUP		(1 << 21)
/** USART2_CR_LINABT Abort LIN Transmission **/
#define USART2_CR_LINABT		(1 << 20)
/** USART2_CR_RTSDIS Request to Send Disable **/
#define USART2_CR_RTSDIS		(1 << 19)
/** USART2_CR_RTSEN Request to Send Enable **/
#define USART2_CR_RTSEN		(1 << 18)
/** USART2_CR_RETTO Rearm Time-out **/
#define USART2_CR_RETTO		(1 << 15)
/** USART2_CR_RSTNACK Reset Non Acknowledge **/
#define USART2_CR_RSTNACK		(1 << 14)
/** USART2_CR_RSTIT Reset Iterations **/
#define USART2_CR_RSTIT		(1 << 13)
/** USART2_CR_SENDA Send Address **/
#define USART2_CR_SENDA		(1 << 12)
/** USART2_CR_STTTO Start Time-out **/
#define USART2_CR_STTTO		(1 << 11)
/** USART2_CR_STPBRK Stop Break **/
#define USART2_CR_STPBRK		(1 << 10)
/** USART2_CR_STTBRK Start Break **/
#define USART2_CR_STTBRK		(1 << 9)
/** USART2_CR_RSTSTA Reset Status Bits **/
#define USART2_CR_RSTSTA		(1 << 8)
/** USART2_CR_TXDIS Transmitter Disable **/
#define USART2_CR_TXDIS		(1 << 7)
/** USART2_CR_TXEN Transmitter Enable **/
#define USART2_CR_TXEN		(1 << 6)
/** USART2_CR_RXDIS Receiver Disable **/
#define USART2_CR_RXDIS		(1 << 5)
/** USART2_CR_RXEN Receiver Enable **/
#define USART2_CR_RXEN		(1 << 4)
/** USART2_CR_RSTTX Reset Transmitter **/
#define USART2_CR_RSTTX		(1 << 3)
/** USART2_CR_RSTRX Reset Receiver **/
#define USART2_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart2_cr_spi_mode CRSPIMODE Control Register
@{*/

/** USART2_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART2_CR_SPI_MODE_RCS		(1 << 19)
/** USART2_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART2_CR_SPI_MODE_FCS		(1 << 18)
/** USART2_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART2_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART2_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART2_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART2_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART2_CR_SPI_MODE_TXEN		(1 << 6)
/** USART2_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART2_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART2_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART2_CR_SPI_MODE_RXEN		(1 << 4)
/** USART2_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART2_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART2_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART2_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart2_mr MR Mode Register
@{*/

/** USART2_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART2_MR_ONEBIT		(1 << 31)
/** USART2_MR_MODSYNC Manchester Synchronization Mode **/
#define USART2_MR_MODSYNC		(1 << 30)
/** USART2_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART2_MR_MAN		(1 << 29)
/** USART2_MR_FILTER Infrared Receive Line Filter **/
#define USART2_MR_FILTER		(1 << 28)

#define USART2_MR_MAX_ITERATION_SHIFT		24
#define USART2_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart2_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART2_MR_INVDATA Inverted Data **/
#define USART2_MR_INVDATA		(1 << 23)
/** USART2_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART2_MR_VAR_SYNC		(1 << 22)
/** USART2_MR_DSNACK Disable Successive NACK **/
#define USART2_MR_DSNACK		(1 << 21)
/** USART2_MR_INACK Inhibit Non Acknowledge **/
#define USART2_MR_INACK		(1 << 20)
/** USART2_MR_OVER Oversampling Mode **/
#define USART2_MR_OVER		(1 << 19)
/** USART2_MR_CLKO Clock Output Select **/
#define USART2_MR_CLKO		(1 << 18)
/** USART2_MR_MODE9 9-bit Character Length **/
#define USART2_MR_MODE9		(1 << 17)
/** USART2_MR_MSBF Bit Order **/
#define USART2_MR_MSBF		(1 << 16)

#define USART2_MR_CHMODE_SHIFT		14
#define USART2_MR_CHMODE_MASK		0x03
/** @defgroup usart2_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART2_MR_NBSTOP_SHIFT		12
#define USART2_MR_NBSTOP_MASK		0x03
/** @defgroup usart2_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART2_MR_PAR_SHIFT		9
#define USART2_MR_PAR_MASK		0x07
/** @defgroup usart2_mr_par PAR Parity Type
@{*/
/**@}*/

/** USART2_MR_SYNC Synchronous Mode Select **/
#define USART2_MR_SYNC		(1 << 8)

#define USART2_MR_CHRL_SHIFT		6
#define USART2_MR_CHRL_MASK		0x03
/** @defgroup usart2_mr_chrl CHRL Character Length
@{*/
/**@}*/


#define USART2_MR_USCLKS_SHIFT		4
#define USART2_MR_USCLKS_MASK		0x03
/** @defgroup usart2_mr_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART2_MR_USART_MODE_SHIFT		0
#define USART2_MR_USART_MODE_MASK		0x0f
/** @defgroup usart2_mr_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_mr_spi_mode MRSPIMODE Mode Register
@{*/

/** USART2_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART2_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART2_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART2_MR_SPI_MODE_CPOL		(1 << 16)
/** USART2_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART2_MR_SPI_MODE_CPHA		(1 << 8)

