grevaillot/svd_tools/headers/ATSAM3X8H/usart2.h
#define USART2_MR_SPI_MODE_CHRL_SHIFT		6
#define USART2_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart2_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART2_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART2_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart2_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART2_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART2_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart2_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_ier IER Interrupt Enable Register
@{*/

/** USART2_IER_MANE Manchester Error Interrupt Enable **/
#define USART2_IER_MANE		(1 << 24)
/** USART2_IER_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART2_IER_CTSIC		(1 << 19)
/** USART2_IER_NACK Non Acknowledge Interrupt Enable **/
#define USART2_IER_NACK		(1 << 13)
/** USART2_IER_RXBUFF Buffer Full Interrupt Enable (available in all USART modes of operation) **/
#define USART2_IER_RXBUFF		(1 << 12)
/** USART2_IER_TXBUFE Buffer Empty Interrupt Enable (available in all USART modes of operation) **/
#define USART2_IER_TXBUFE		(1 << 11)
/** USART2_IER_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART2_IER_ITER		(1 << 10)
/** USART2_IER_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART2_IER_TXEMPTY		(1 << 9)
/** USART2_IER_TIMEOUT Time-out Interrupt Enable **/
#define USART2_IER_TIMEOUT		(1 << 8)
/** USART2_IER_PARE Parity Error Interrupt Enable **/
#define USART2_IER_PARE		(1 << 7)
/** USART2_IER_FRAME Framing Error Interrupt Enable **/
#define USART2_IER_FRAME		(1 << 6)
/** USART2_IER_OVRE Overrun Error Interrupt Enable **/
#define USART2_IER_OVRE		(1 << 5)
/** USART2_IER_ENDTX End of Transmit Interrupt Enable (available in all USART modes of operation) **/
#define USART2_IER_ENDTX		(1 << 4)
/** USART2_IER_ENDRX End of Receive Transfer Interrupt Enable (available in all USART modes of operation) **/
#define USART2_IER_ENDRX		(1 << 3)
/** USART2_IER_RXBRK Receiver Break Interrupt Enable **/
#define USART2_IER_RXBRK		(1 << 2)
/** USART2_IER_TXRDY TXRDY Interrupt Enable **/
#define USART2_IER_TXRDY		(1 << 1)
/** USART2_IER_RXRDY RXRDY Interrupt Enable **/
#define USART2_IER_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_ier_spi_mode IERSPIMODE Interrupt Enable Register
@{*/

/** USART2_IER_SPI_MODE_RXBUFF  **/
#define USART2_IER_SPI_MODE_RXBUFF		(1 << 12)
/** USART2_IER_SPI_MODE_TXBUFE  **/
#define USART2_IER_SPI_MODE_TXBUFE		(1 << 11)
/** USART2_IER_SPI_MODE_UNRE SPI Underrun Error Interrupt Enable **/
#define USART2_IER_SPI_MODE_UNRE		(1 << 10)
/** USART2_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART2_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART2_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART2_IER_SPI_MODE_OVRE		(1 << 5)
/** USART2_IER_SPI_MODE_ENDTX  **/
#define USART2_IER_SPI_MODE_ENDTX		(1 << 4)
/** USART2_IER_SPI_MODE_ENDRX  **/
#define USART2_IER_SPI_MODE_ENDRX		(1 << 3)
/** USART2_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART2_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART2_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART2_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_ier_lin_mode IERLINMODE Interrupt Enable Register
@{*/

/** USART2_IER_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINSNRE		(1 << 29)
/** USART2_IER_LIN_MODE_LINCE LIN Checksum Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINCE		(1 << 28)
/** USART2_IER_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINIPE		(1 << 27)
/** USART2_IER_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINISFE		(1 << 26)
/** USART2_IER_LIN_MODE_LINBE LIN Bus Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINBE		(1 << 25)
/** USART2_IER_LIN_MODE_LINTC LIN Transfer Completed Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINTC		(1 << 15)
/** USART2_IER_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINID		(1 << 14)
/** USART2_IER_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Enable **/
#define USART2_IER_LIN_MODE_LINBK		(1 << 13)
/** USART2_IER_LIN_MODE_RXBUFF  **/
#define USART2_IER_LIN_MODE_RXBUFF		(1 << 12)
/** USART2_IER_LIN_MODE_TXBUFE  **/
#define USART2_IER_LIN_MODE_TXBUFE		(1 << 11)
/** USART2_IER_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART2_IER_LIN_MODE_TXEMPTY		(1 << 9)
/** USART2_IER_LIN_MODE_TIMEOUT Time-out Interrupt Enable **/
#define USART2_IER_LIN_MODE_TIMEOUT		(1 << 8)
/** USART2_IER_LIN_MODE_PARE Parity Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_PARE		(1 << 7)
/** USART2_IER_LIN_MODE_FRAME Framing Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_FRAME		(1 << 6)
/** USART2_IER_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART2_IER_LIN_MODE_OVRE		(1 << 5)
/** USART2_IER_LIN_MODE_ENDTX  **/
#define USART2_IER_LIN_MODE_ENDTX		(1 << 4)
/** USART2_IER_LIN_MODE_ENDRX  **/
#define USART2_IER_LIN_MODE_ENDRX		(1 << 3)
/** USART2_IER_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART2_IER_LIN_MODE_TXRDY		(1 << 1)
/** USART2_IER_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART2_IER_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_idr IDR Interrupt Disable Register
@{*/

/** USART2_IDR_MANE Manchester Error Interrupt Disable **/
#define USART2_IDR_MANE		(1 << 24)
/** USART2_IDR_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART2_IDR_CTSIC		(1 << 19)
/** USART2_IDR_NACK Non Acknowledge Interrupt Disable **/
#define USART2_IDR_NACK		(1 << 13)
/** USART2_IDR_RXBUFF Buffer Full Interrupt Disable (available in all USART modes of operation) **/
#define USART2_IDR_RXBUFF		(1 << 12)
/** USART2_IDR_TXBUFE Buffer Empty Interrupt Disable (available in all USART modes of operation) **/
#define USART2_IDR_TXBUFE		(1 << 11)
/** USART2_IDR_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART2_IDR_ITER		(1 << 10)
/** USART2_IDR_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART2_IDR_TXEMPTY		(1 << 9)
/** USART2_IDR_TIMEOUT Time-out Interrupt Disable **/
#define USART2_IDR_TIMEOUT		(1 << 8)
/** USART2_IDR_PARE Parity Error Interrupt Disable **/
#define USART2_IDR_PARE		(1 << 7)
/** USART2_IDR_FRAME Framing Error Interrupt Disable **/
#define USART2_IDR_FRAME		(1 << 6)
/** USART2_IDR_OVRE Overrun Error Interrupt Enable **/
#define USART2_IDR_OVRE		(1 << 5)
/** USART2_IDR_ENDTX End of Transmit Interrupt Disable (available in all USART modes of operation) **/
#define USART2_IDR_ENDTX		(1 << 4)
/** USART2_IDR_ENDRX End of Receive Transfer Interrupt Disable (available in all USART modes of operation) **/
#define USART2_IDR_ENDRX		(1 << 3)
/** USART2_IDR_RXBRK Receiver Break Interrupt Disable **/
#define USART2_IDR_RXBRK		(1 << 2)
/** USART2_IDR_TXRDY TXRDY Interrupt Disable **/
#define USART2_IDR_TXRDY		(1 << 1)
/** USART2_IDR_RXRDY RXRDY Interrupt Disable **/
#define USART2_IDR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_idr_spi_mode IDRSPIMODE Interrupt Disable Register
@{*/

/** USART2_IDR_SPI_MODE_RXBUFF  **/
#define USART2_IDR_SPI_MODE_RXBUFF		(1 << 12)
/** USART2_IDR_SPI_MODE_TXBUFE  **/
#define USART2_IDR_SPI_MODE_TXBUFE		(1 << 11)
/** USART2_IDR_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART2_IDR_SPI_MODE_UNRE		(1 << 10)
/** USART2_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART2_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART2_IDR_SPI_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART2_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART2_IDR_SPI_MODE_ENDTX  **/
#define USART2_IDR_SPI_MODE_ENDTX		(1 << 4)
/** USART2_IDR_SPI_MODE_ENDRX  **/
#define USART2_IDR_SPI_MODE_ENDRX		(1 << 3)
/** USART2_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART2_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART2_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART2_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_idr_lin_mode IDRLINMODE Interrupt Disable Register
@{*/

/** USART2_IDR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINSNRE		(1 << 29)
/** USART2_IDR_LIN_MODE_LINCE LIN Checksum Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINCE		(1 << 28)
/** USART2_IDR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINIPE		(1 << 27)
/** USART2_IDR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINISFE		(1 << 26)
/** USART2_IDR_LIN_MODE_LINBE LIN Bus Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINBE		(1 << 25)
/** USART2_IDR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINTC		(1 << 15)
/** USART2_IDR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINID		(1 << 14)
/** USART2_IDR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Disable **/
#define USART2_IDR_LIN_MODE_LINBK		(1 << 13)
/** USART2_IDR_LIN_MODE_RXBUFF  **/
#define USART2_IDR_LIN_MODE_RXBUFF		(1 << 12)
/** USART2_IDR_LIN_MODE_TXBUFE  **/
#define USART2_IDR_LIN_MODE_TXBUFE		(1 << 11)
/** USART2_IDR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART2_IDR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART2_IDR_LIN_MODE_TIMEOUT Time-out Interrupt Disable **/
#define USART2_IDR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART2_IDR_LIN_MODE_PARE Parity Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_PARE		(1 << 7)
/** USART2_IDR_LIN_MODE_FRAME Framing Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_FRAME		(1 << 6)
/** USART2_IDR_LIN_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART2_IDR_LIN_MODE_OVRE		(1 << 5)
/** USART2_IDR_LIN_MODE_ENDTX  **/
#define USART2_IDR_LIN_MODE_ENDTX		(1 << 4)
/** USART2_IDR_LIN_MODE_ENDRX  **/
#define USART2_IDR_LIN_MODE_ENDRX		(1 << 3)
/** USART2_IDR_LIN_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART2_IDR_LIN_MODE_TXRDY		(1 << 1)
/** USART2_IDR_LIN_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART2_IDR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_imr IMR Interrupt Mask Register
@{*/

