grevaillot/svd_tools/headers/ATSAM3X8H/usart2.h
/** USART2_IMR_MANE Manchester Error Interrupt Mask **/
#define USART2_IMR_MANE		(1 << 24)
/** USART2_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART2_IMR_CTSIC		(1 << 19)
/** USART2_IMR_NACK Non Acknowledge Interrupt Mask **/
#define USART2_IMR_NACK		(1 << 13)
/** USART2_IMR_RXBUFF Buffer Full Interrupt Mask (available in all USART modes of operation) **/
#define USART2_IMR_RXBUFF		(1 << 12)
/** USART2_IMR_TXBUFE Buffer Empty Interrupt Mask (available in all USART modes of operation) **/
#define USART2_IMR_TXBUFE		(1 << 11)
/** USART2_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART2_IMR_ITER		(1 << 10)
/** USART2_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART2_IMR_TXEMPTY		(1 << 9)
/** USART2_IMR_TIMEOUT Time-out Interrupt Mask **/
#define USART2_IMR_TIMEOUT		(1 << 8)
/** USART2_IMR_PARE Parity Error Interrupt Mask **/
#define USART2_IMR_PARE		(1 << 7)
/** USART2_IMR_FRAME Framing Error Interrupt Mask **/
#define USART2_IMR_FRAME		(1 << 6)
/** USART2_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART2_IMR_OVRE		(1 << 5)
/** USART2_IMR_ENDTX End of Transmit Interrupt Mask (available in all USART modes of operation) **/
#define USART2_IMR_ENDTX		(1 << 4)
/** USART2_IMR_ENDRX End of Receive Transfer Interrupt Mask (available in all USART modes of operation) **/
#define USART2_IMR_ENDRX		(1 << 3)
/** USART2_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART2_IMR_RXBRK		(1 << 2)
/** USART2_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART2_IMR_TXRDY		(1 << 1)
/** USART2_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART2_IMR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART2_IMR_SPI_MODE_RXBUFF  **/
#define USART2_IMR_SPI_MODE_RXBUFF		(1 << 12)
/** USART2_IMR_SPI_MODE_TXBUFE  **/
#define USART2_IMR_SPI_MODE_TXBUFE		(1 << 11)
/** USART2_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART2_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART2_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART2_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART2_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART2_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART2_IMR_SPI_MODE_ENDTX  **/
#define USART2_IMR_SPI_MODE_ENDTX		(1 << 4)
/** USART2_IMR_SPI_MODE_ENDRX  **/
#define USART2_IMR_SPI_MODE_ENDRX		(1 << 3)
/** USART2_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART2_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART2_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART2_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_imr_lin_mode IMRLINMODE Interrupt Mask Register
@{*/

/** USART2_IMR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINSNRE		(1 << 29)
/** USART2_IMR_LIN_MODE_LINCE LIN Checksum Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINCE		(1 << 28)
/** USART2_IMR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINIPE		(1 << 27)
/** USART2_IMR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINISFE		(1 << 26)
/** USART2_IMR_LIN_MODE_LINBE LIN Bus Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINBE		(1 << 25)
/** USART2_IMR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINTC		(1 << 15)
/** USART2_IMR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINID		(1 << 14)
/** USART2_IMR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Mask **/
#define USART2_IMR_LIN_MODE_LINBK		(1 << 13)
/** USART2_IMR_LIN_MODE_RXBUFF  **/
#define USART2_IMR_LIN_MODE_RXBUFF		(1 << 12)
/** USART2_IMR_LIN_MODE_TXBUFE  **/
#define USART2_IMR_LIN_MODE_TXBUFE		(1 << 11)
/** USART2_IMR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART2_IMR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART2_IMR_LIN_MODE_TIMEOUT Time-out Interrupt Mask **/
#define USART2_IMR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART2_IMR_LIN_MODE_PARE Parity Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_PARE		(1 << 7)
/** USART2_IMR_LIN_MODE_FRAME Framing Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_FRAME		(1 << 6)
/** USART2_IMR_LIN_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART2_IMR_LIN_MODE_OVRE		(1 << 5)
/** USART2_IMR_LIN_MODE_ENDTX  **/
#define USART2_IMR_LIN_MODE_ENDTX		(1 << 4)
/** USART2_IMR_LIN_MODE_ENDRX  **/
#define USART2_IMR_LIN_MODE_ENDRX		(1 << 3)
/** USART2_IMR_LIN_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART2_IMR_LIN_MODE_TXRDY		(1 << 1)
/** USART2_IMR_LIN_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART2_IMR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_csr CSR Channel Status Register
@{*/

/** USART2_CSR_MANERR Manchester Error **/
#define USART2_CSR_MANERR		(1 << 24)
/** USART2_CSR_CTS Image of CTS Input **/
#define USART2_CSR_CTS		(1 << 23)
/** USART2_CSR_CTSIC Clear to Send Input Change Flag **/
#define USART2_CSR_CTSIC		(1 << 19)
/** USART2_CSR_NACK Non Acknowledge Interrupt **/
#define USART2_CSR_NACK		(1 << 13)
/** USART2_CSR_RXBUFF Reception Buffer Full **/
#define USART2_CSR_RXBUFF		(1 << 12)
/** USART2_CSR_TXBUFE Transmission Buffer Empty **/
#define USART2_CSR_TXBUFE		(1 << 11)
/** USART2_CSR_ITER Max Number of Repetitions Reached **/
#define USART2_CSR_ITER		(1 << 10)
/** USART2_CSR_TXEMPTY Transmitter Empty **/
#define USART2_CSR_TXEMPTY		(1 << 9)
/** USART2_CSR_TIMEOUT Receiver Time-out **/
#define USART2_CSR_TIMEOUT		(1 << 8)
/** USART2_CSR_PARE Parity Error **/
#define USART2_CSR_PARE		(1 << 7)
/** USART2_CSR_FRAME Framing Error **/
#define USART2_CSR_FRAME		(1 << 6)
/** USART2_CSR_OVRE Overrun Error **/
#define USART2_CSR_OVRE		(1 << 5)
/** USART2_CSR_ENDTX End of Transmitter Transfer **/
#define USART2_CSR_ENDTX		(1 << 4)
/** USART2_CSR_ENDRX End of Receiver Transfer **/
#define USART2_CSR_ENDRX		(1 << 3)
/** USART2_CSR_RXBRK Break Received/End of Break **/
#define USART2_CSR_RXBRK		(1 << 2)
/** USART2_CSR_TXRDY Transmitter Ready **/
#define USART2_CSR_TXRDY		(1 << 1)
/** USART2_CSR_RXRDY Receiver Ready **/
#define USART2_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

