grevaillot/svd_tools/headers/ATSAM3X8H/usart2.h
/** USART2_CSR_SPI_MODE_RXBUFF  **/
#define USART2_CSR_SPI_MODE_RXBUFF		(1 << 12)
/** USART2_CSR_SPI_MODE_TXBUFE  **/
#define USART2_CSR_SPI_MODE_TXBUFE		(1 << 11)
/** USART2_CSR_SPI_MODE_UNRE Underrun Error **/
#define USART2_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART2_CSR_SPI_MODE_TXEMPTY Transmitter Empty **/
#define USART2_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART2_CSR_SPI_MODE_OVRE Overrun Error **/
#define USART2_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART2_CSR_SPI_MODE_ENDTX  **/
#define USART2_CSR_SPI_MODE_ENDTX		(1 << 4)
/** USART2_CSR_SPI_MODE_ENDRX  **/
#define USART2_CSR_SPI_MODE_ENDRX		(1 << 3)
/** USART2_CSR_SPI_MODE_TXRDY Transmitter Ready **/
#define USART2_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART2_CSR_SPI_MODE_RXRDY Receiver Ready **/
#define USART2_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_csr_lin_mode CSRLINMODE Channel Status Register
@{*/

/** USART2_CSR_LIN_MODE_LINSNRE LIN Slave Not Responding Error **/
#define USART2_CSR_LIN_MODE_LINSNRE		(1 << 29)
/** USART2_CSR_LIN_MODE_LINCE LIN Checksum Error **/
#define USART2_CSR_LIN_MODE_LINCE		(1 << 28)
/** USART2_CSR_LIN_MODE_LINIPE LIN Identifier Parity Error **/
#define USART2_CSR_LIN_MODE_LINIPE		(1 << 27)
/** USART2_CSR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error **/
#define USART2_CSR_LIN_MODE_LINISFE		(1 << 26)
/** USART2_CSR_LIN_MODE_LINBE LIN Bit Error **/
#define USART2_CSR_LIN_MODE_LINBE		(1 << 25)
/** USART2_CSR_LIN_MODE_LINBLS LIN Bus Line Status **/
#define USART2_CSR_LIN_MODE_LINBLS		(1 << 23)
/** USART2_CSR_LIN_MODE_LINTC LIN Transfer Completed **/
#define USART2_CSR_LIN_MODE_LINTC		(1 << 15)
/** USART2_CSR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received **/
#define USART2_CSR_LIN_MODE_LINID		(1 << 14)
/** USART2_CSR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received **/
#define USART2_CSR_LIN_MODE_LINBK		(1 << 13)
/** USART2_CSR_LIN_MODE_RXBUFF  **/
#define USART2_CSR_LIN_MODE_RXBUFF		(1 << 12)
/** USART2_CSR_LIN_MODE_TXBUFE  **/
#define USART2_CSR_LIN_MODE_TXBUFE		(1 << 11)
/** USART2_CSR_LIN_MODE_TXEMPTY Transmitter Empty **/
#define USART2_CSR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART2_CSR_LIN_MODE_TIMEOUT Receiver Time-out **/
#define USART2_CSR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART2_CSR_LIN_MODE_PARE Parity Error **/
#define USART2_CSR_LIN_MODE_PARE		(1 << 7)
/** USART2_CSR_LIN_MODE_FRAME Framing Error **/
#define USART2_CSR_LIN_MODE_FRAME		(1 << 6)
/** USART2_CSR_LIN_MODE_OVRE Overrun Error **/
#define USART2_CSR_LIN_MODE_OVRE		(1 << 5)
/** USART2_CSR_LIN_MODE_ENDTX  **/
#define USART2_CSR_LIN_MODE_ENDTX		(1 << 4)
/** USART2_CSR_LIN_MODE_ENDRX  **/
#define USART2_CSR_LIN_MODE_ENDRX		(1 << 3)
/** USART2_CSR_LIN_MODE_TXRDY Transmitter Ready **/
#define USART2_CSR_LIN_MODE_TXRDY		(1 << 1)
/** USART2_CSR_LIN_MODE_RXRDY Receiver Ready **/
#define USART2_CSR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_rhr RHR Receive Holding Register
@{*/

/** USART2_RHR_RXSYNH Received Sync **/
#define USART2_RHR_RXSYNH		(1 << 15)

#define USART2_RHR_RXCHR_SHIFT		0
#define USART2_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart2_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_thr THR Transmit Holding Register
@{*/

/** USART2_THR_TXSYNH Sync Field to be Transmitted **/
#define USART2_THR_TXSYNH		(1 << 15)

#define USART2_THR_TXCHR_SHIFT		0
#define USART2_THR_TXCHR_MASK		0x1ff
/** @defgroup usart2_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_brgr BRGR Baud Rate Generator Register
@{*/


#define USART2_BRGR_FP_SHIFT		16
#define USART2_BRGR_FP_MASK		0x07
/** @defgroup usart2_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART2_BRGR_CD_SHIFT		0
#define USART2_BRGR_CD_MASK		0xffff
/** @defgroup usart2_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_rtor RTOR Receiver Time-out Register
@{*/


#define USART2_RTOR_TO_SHIFT		0
#define USART2_RTOR_TO_MASK		0x1ffff
/** @defgroup usart2_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART2_TTGR_TG_SHIFT		0
#define USART2_TTGR_TG_MASK		0xff
/** @defgroup usart2_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_fidi FIDI FI DI Ratio Register
@{*/


#define USART2_FIDI_FI_DI_RATIO_SHIFT		0
#define USART2_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart2_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_ner NER Number of Errors Register
@{*/


#define USART2_NER_NB_ERRORS_SHIFT		0
#define USART2_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart2_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_if IF IrDA Filter Register
@{*/


#define USART2_IF_IRDA_FILTER_SHIFT		0
#define USART2_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart2_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_man MAN Manchester Configuration Register
@{*/

/** USART2_MAN_DRIFT Drift Compensation **/
#define USART2_MAN_DRIFT		(1 << 30)
/** USART2_MAN_ONE Must Be Set to 1 **/
#define USART2_MAN_ONE		(1 << 29)
/** USART2_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART2_MAN_RX_MPOL		(1 << 28)

#define USART2_MAN_RX_PP_SHIFT		24
#define USART2_MAN_RX_PP_MASK		0x03
/** @defgroup usart2_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART2_MAN_RX_PL_SHIFT		16
#define USART2_MAN_RX_PL_MASK		0x0f
/** @defgroup usart2_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART2_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART2_MAN_TX_MPOL		(1 << 12)

#define USART2_MAN_TX_PP_SHIFT		8
#define USART2_MAN_TX_PP_MASK		0x03
/** @defgroup usart2_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART2_MAN_TX_PL_SHIFT		0
#define USART2_MAN_TX_PL_MASK		0x0f
/** @defgroup usart2_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_linmr LINMR LIN Mode Register
@{*/

/** USART2_LINMR_PDCM PDC Mode **/
#define USART2_LINMR_PDCM		(1 << 16)

#define USART2_LINMR_DLC_SHIFT		8
#define USART2_LINMR_DLC_MASK		0xff
/** @defgroup usart2_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART2_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART2_LINMR_WKUPTYP		(1 << 7)
/** USART2_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART2_LINMR_FSDIS		(1 << 6)
/** USART2_LINMR_DLM Data Length Mode **/
#define USART2_LINMR_DLM		(1 << 5)
/** USART2_LINMR_CHKTYP Checksum Type **/
#define USART2_LINMR_CHKTYP		(1 << 4)
/** USART2_LINMR_CHKDIS Checksum Disable **/
#define USART2_LINMR_CHKDIS		(1 << 3)
/** USART2_LINMR_PARDIS Parity Disable **/
#define USART2_LINMR_PARDIS		(1 << 2)

#define USART2_LINMR_NACT_SHIFT		0
#define USART2_LINMR_NACT_MASK		0x03
/** @defgroup usart2_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_linir LINIR LIN Identifier Register
@{*/


