grevaillot/svd_tools/headers/ATSAM3X8H/usart2.h
#define USART2_LINIR_IDCHR_SHIFT		0
#define USART2_LINIR_IDCHR_MASK		0xff
/** @defgroup usart2_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_linbrr LINBRR LIN Baud Rate Register
@{*/


#define USART2_LINBRR_LINFP_SHIFT		16
#define USART2_LINBRR_LINFP_MASK		0x07
/** @defgroup usart2_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART2_LINBRR_LINCD_SHIFT		0
#define USART2_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart2_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_wpmr WPMR Write Protection Mode Register
@{*/


#define USART2_WPMR_WPKEY_SHIFT		8
#define USART2_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart2_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART2_WPMR_WPEN Write Protection Enable **/
#define USART2_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart2_wpsr WPSR Write Protection Status Register
@{*/


#define USART2_WPSR_WPVSRC_SHIFT		8
#define USART2_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart2_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART2_WPSR_WPVS Write Protection Violation Status **/
#define USART2_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart2_rpr RPR Receive Pointer Register
@{*/


#define USART2_RPR_RXPTR_SHIFT		0
#define USART2_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart2_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_rcr RCR Receive Counter Register
@{*/


#define USART2_RCR_RXCTR_SHIFT		0
#define USART2_RCR_RXCTR_MASK		0xffff
/** @defgroup usart2_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_tpr TPR Transmit Pointer Register
@{*/


#define USART2_TPR_TXPTR_SHIFT		0
#define USART2_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart2_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_tcr TCR Transmit Counter Register
@{*/


#define USART2_TCR_TXCTR_SHIFT		0
#define USART2_TCR_TXCTR_MASK		0xffff
/** @defgroup usart2_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_rnpr RNPR Receive Next Pointer Register
@{*/


#define USART2_RNPR_RXNPTR_SHIFT		0
#define USART2_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup usart2_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_rncr RNCR Receive Next Counter Register
@{*/


#define USART2_RNCR_RXNCTR_SHIFT		0
#define USART2_RNCR_RXNCTR_MASK		0xffff
/** @defgroup usart2_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_tnpr TNPR Transmit Next Pointer Register
@{*/


#define USART2_TNPR_TXNPTR_SHIFT		0
#define USART2_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup usart2_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_tncr TNCR Transmit Next Counter Register
@{*/


#define USART2_TNCR_TXNCTR_SHIFT		0
#define USART2_TNCR_TXNCTR_MASK		0xffff
/** @defgroup usart2_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_ptcr PTCR Transfer Control Register
@{*/

/** USART2_PTCR_TXTDIS Transmitter Transfer Disable **/
#define USART2_PTCR_TXTDIS		(1 << 9)
/** USART2_PTCR_TXTEN Transmitter Transfer Enable **/
#define USART2_PTCR_TXTEN		(1 << 8)
/** USART2_PTCR_RXTDIS Receiver Transfer Disable **/
#define USART2_PTCR_RXTDIS		(1 << 1)
/** USART2_PTCR_RXTEN Receiver Transfer Enable **/
#define USART2_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup usart2_ptsr PTSR Transfer Status Register
@{*/

/** USART2_PTSR_TXTEN Transmitter Transfer Enable **/
#define USART2_PTSR_TXTEN		(1 << 8)
/** USART2_PTSR_RXTEN Receiver Transfer Enable **/
#define USART2_PTSR_RXTEN		(1 << 0)

/**@}*/
